---
title: AssemblyFailures
classe: Autodesk.Revit.DB.BuiltInFailures+AssemblyFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# AssemblyFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AddedElementsNotSamePhaseAsAssembly { get; }` | `AssemblyFailures.AddedElementsNotSamePhaseAsAssembly` | FailureDefinitionId |
| `FailureDefinitionId AssemblyDeleteTypeWarn { get; }` | `AssemblyFailures.AssemblyDeleteTypeWarn` | FailureDefinitionId |
| `FailureDefinitionId AssemblyDidNotMatchRequestedTypeWarn { get; }` | `AssemblyFailures.AssemblyDidNotMatchRequestedTypeWarn` | FailureDefinitionId |
| `FailureDefinitionId AssemblyDisassembleInstanceWarn { get; }` | `AssemblyFailures.AssemblyDisassembleInstanceWarn` | FailureDefinitionId |
| `FailureDefinitionId AssemblyInheritTypeWarn { get; }` | `AssemblyFailures.AssemblyInheritTypeWarn` | FailureDefinitionId |
| `FailureDefinitionId AssemblyInvalidMember { get; }` | `AssemblyFailures.AssemblyInvalidMember` | FailureDefinitionId |
| `FailureDefinitionId AssemblyNewTypeWarn { get; }` | `AssemblyFailures.AssemblyNewTypeWarn` | FailureDefinitionId |
| `FailureDefinitionId AssemblyRenameTypeWarn { get; }` | `AssemblyFailures.AssemblyRenameTypeWarn` | FailureDefinitionId |
| `FailureDefinitionId CouldNotAcquireAssemblyViews { get; }` | `AssemblyFailures.CouldNotAcquireAssemblyViews` | FailureDefinitionId |
| `FailureDefinitionId CouldNotChangeTypeOfAssembly { get; }` | `AssemblyFailures.CouldNotChangeTypeOfAssembly` | FailureDefinitionId |
| `FailureDefinitionId DeleteAssemblyInstWithViewsWarn { get; }` | `AssemblyFailures.DeleteAssemblyInstWithViewsWarn` | FailureDefinitionId |
| `FailureDefinitionId DeleteShopDrawingsWarn { get; }` | `AssemblyFailures.DeleteShopDrawingsWarn` | FailureDefinitionId |
| `FailureDefinitionId ElementsNotAllowedAreNotAddedToAssembly { get; }` | `AssemblyFailures.ElementsNotAllowedAreNotAddedToAssembly` | FailureDefinitionId |
| `FailureDefinitionId IneligibleElementsInAssembly { get; }` | `AssemblyFailures.IneligibleElementsInAssembly` | FailureDefinitionId |
| `FailureDefinitionId MixedPhasesInAssembly { get; }` | `AssemblyFailures.MixedPhasesInAssembly` | FailureDefinitionId |
| `FailureDefinitionId NoElementsAddedtoNewAssembly { get; }` | `AssemblyFailures.NoElementsAddedtoNewAssembly` | FailureDefinitionId |
| `FailureDefinitionId NoElementsLeftInExistingAssembly { get; }` | `AssemblyFailures.NoElementsLeftInExistingAssembly` | FailureDefinitionId |
| `FailureDefinitionId NoEligibleElementsInAssembly { get; }` | `AssemblyFailures.NoEligibleElementsInAssembly` | FailureDefinitionId |
| `FailureDefinitionId SomeElementsPreventAssemblyTypeChange { get; }` | `AssemblyFailures.SomeElementsPreventAssemblyTypeChange` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```